Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetPolyloops
Gets the collection of planar polygons describing the surface geometry.
Remarks:
A collection of polyloops (planar polygons) describing the surface geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Returns:
The collection of polygons describing the surface geometry.
Since:
2023

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetPolyloop
Gets the planar polygon describing the surface geometry.
Remarks:
A planar polygon describing the surface geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Returns:
The planar polygon describing the surface geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetConstruction
Gets the analytic construction this surface is associated with.
Returns:
The analytic construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.OriginatingElementName
The name for the originating Revit element.
Remarks:
Surface elements get an originating element assigned according to the below described schema, based on associative room bounding element:
(Family Name) : (Family Type)Sample:
Basic Wall : Cast Concrete Wall 12"
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.OriginatingElementId
The element id for the originating Revit element.
Since:
2024